{"config": [{"config": {"W_constraint": null, "input_dtype": "int32", "batch_input_shape": [null, 100], "W_regularizer": null, "input_length": 100, "name": "embedding_1", "init": "uniform", "mask_zero": false, "activity_regularizer": null, "dropout": 0.0, "trainable": true, "input_dim": 20000, "output_dim": 128}, "class_name": "Embedding"}, {"config": {"merge_mode": "concat", "layer": {"config": {"b_regularizer": null, "U_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "W_regularizer": null, "input_length": null, "name": "lstm_1", "input_dim": null, "return_sequences": false, "dropout_W": 0.0, "init": "glorot_uniform", "stateful": false, "unroll": false, "go_backwards": false, "forget_bias_init": "one", "consume_less": "cpu", "dropout_U": 0.0, "activation": "tanh", "trainable": true, "output_dim": 64}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_1"}, "class_name": "Bidirectional"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_constraint": null, "input_dim": 128, "b_constraint": null, "bias": true, "W_regularizer": null, "name": "dense_1", "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}